Can't rotate Element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CantChangeParamRotate { get; }
  Visual Basic
Public Shared ReadOnly Property CantChangeParamRotate As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantChangeParamRotate {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PointFailures Class
  Autodesk.Revit.DB Namespace